{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution24_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "20"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution24_bias", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "20"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution24", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "20"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation36", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[3, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling24", 
      "attr": {
        "kernel": "(1, 1)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[4, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution25_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "50"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution25_bias", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "50"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution25", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "50"
      }, 
      "inputs": [[5, 0, 0], [6, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation37", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling25", 
      "attr": {
        "kernel": "(1, 1)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[9, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten12", 
      "inputs": [[10, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fullyconnected24_weight", 
      "attr": {"num_hidden": "500"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fullyconnected24_bias", 
      "attr": {"num_hidden": "500"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected24", 
      "attr": {"num_hidden": "500"}, 
      "inputs": [[11, 0, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation38", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[14, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fullyconnected25_weight", 
      "attr": {"num_hidden": "40"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fullyconnected25_bias", 
      "attr": {"num_hidden": "40"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected25", 
      "attr": {"num_hidden": "40"}, 
      "inputs": [[15, 0, 0], [16, 0, 0], [17, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "softmaxoutput12_label", 
      "inputs": []
    }, 
    {
      "op": "SoftmaxOutput", 
      "name": "softmaxoutput12", 
      "inputs": [[18, 0, 0], [19, 0, 0]]
    }
  ], 
  "arg_nodes": [0, 1, 2, 6, 7, 12, 13, 16, 17, 19], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21
  ], 
  "heads": [[20, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 901]}
}